// Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

Console.WriteLine("Insert first number");
int num1 = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Insert second number");
int num2 = Convert.ToInt32(Console.ReadLine());

if (num1 > num2)
{
    Console.WriteLine("First number is bigger");
}
else
{
    Console.WriteLine("Second is bigger");
}

//Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
